sysbench/oltp_update_index_baseline.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 1738.62 qps: 1738.62 (r/w/o: 0.00/1738.62/0.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 1592.56 qps: 1592.56 (r/w/o: 0.00/1592.56/0.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 1631.61 qps: 1631.61 (r/w/o: 0.00/1631.61/0.00) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 1651.89 qps: 1651.89 (r/w/o: 0.00/1651.89/0.00) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 1644.62 qps: 1644.62 (r/w/o: 0.00/1644.62/0.00) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 1638.47 qps: 1638.47 (r/w/o: 0.00/1638.47/0.00) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 1637.45 qps: 1637.45 (r/w/o: 0.00/1637.45/0.00) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 1521.35 qps: 1521.35 (r/w/o: 0.00/1521.35/0.00) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 1633.66 qps: 1633.66 (r/w/o: 0.00/1633.66/0.00) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 1640.66 qps: 1640.66 (r/w/o: 0.00/1640.66/0.00) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       9.734 |                                         1
       9.910 |                                         1
      10.274 |                                         2
      10.460 |                                         8
      10.651 |                                         13
      10.844 |                                         7
      11.041 |                                         22
      11.242 |                                         13
      11.446 |                                         30
      11.654 |                                         44
      11.866 |                                         47
      12.081 |                                         73
      12.301 |                                         95
      12.524 |*                                        165
      12.752 |*                                        208
      12.984 |*                                        255
      13.219 |**                                       330
      13.460 |**                                       479
      13.704 |***                                      563
      13.953 |****                                     797
      14.207 |*****                                    1122
      14.465 |*******                                  1406
      14.728 |*********                                1809
      14.995 |***********                              2196
      15.268 |**************                           3013
      15.545 |*****************                        3521
      15.828 |********************                     4197
      16.115 |************************                 5022
      16.408 |****************************             5754
      16.706 |********************************         6643
      17.010 |**********************************       7132
      17.319 |***************************************  8194
      17.633 |**************************************** 8347
      17.954 |**************************************** 8325
      18.280 |**************************************   7887
      18.612 |**************************************   7886
      18.950 |************************************     7423
      19.295 |*********************************        6893
      19.645 |********************************         6669
      20.002 |*****************************            6012
      20.366 |**************************               5479
      20.736 |************************                 5083
      21.112 |**********************                   4518
      21.496 |*******************                      3983
      21.886 |*****************                        3547
      22.284 |***************                          3107
      22.689 |**************                           2934
      23.101 |***********                              2369
      23.521 |**********                               2005
      23.948 |*********                                1936
      24.384 |********                                 1614
      24.827 |*******                                  1423
      25.278 |******                                   1220
      25.737 |*****                                    1101
      26.205 |*****                                    1043
      26.681 |*****                                    977
      27.165 |****                                     775
      27.659 |****                                     758
      28.162 |***                                      693
      28.673 |***                                      604
      29.194 |***                                      551
      29.725 |**                                       473
      30.265 |***                                      545
      30.815 |**                                       480
      31.375 |**                                       433
      31.945 |**                                       444
      32.525 |**                                       382
      33.116 |*                                        313
      33.718 |*                                        291
      34.330 |*                                        269
      34.954 |*                                        259
      35.589 |*                                        192
      36.236 |*                                        140
      36.894 |*                                        109
      37.565 |                                         74
      38.247 |                                         58
      38.942 |                                         47
      39.650 |                                         42
      40.370 |                                         59
      41.104 |                                         30
      41.851 |                                         30
      42.611 |                                         46
      43.385 |                                         40
      44.173 |                                         19
      44.976 |                                         22
      45.793 |                                         43
      46.625 |                                         13
      47.472 |                                         38
      48.335 |                                         10
      49.213 |                                         5
      50.107 |                                         6
      51.018 |                                         2
      51.945 |                                         3
      52.889 |                                         7
      53.850 |                                         3
      54.828 |                                         4
      55.824 |                                         3
      56.839 |                                         2
      57.871 |                                         2
      58.923 |                                         4
      59.993 |                                         4
      61.083 |                                         5
      62.193 |                                         2
      63.323 |                                         7
      64.474 |                                         3
      70.548 |                                         1
      73.135 |                                         1
      77.194 |                                         1
      94.104 |                                         1
     118.924 |                                         1
     137.350 |                                         1
     144.974 |                                         1
     147.608 |                                         1
     150.290 |                                         2
     153.021 |                                         5
     158.632 |                                         1
     161.514 |                                         2
     167.437 |                                         2
     170.479 |                                         2
     173.577 |                                         1
     176.731 |                                         2
     179.942 |                                         1
     183.211 |                                         1
     186.540 |                                         2
     189.929 |                                         3
     193.380 |                                         3
     200.472 |                                         3
     204.114 |                                         2
     207.823 |                                         2
     211.599 |                                         1
     215.443 |                                         3
     227.402 |                                         3
     231.534 |                                         1
     235.740 |                                         1
    2082.910 |                                         1
    3040.139 |                                         2
    3095.377 |                                         1
    3151.619 |                                         1
    3911.789 |                                         1
    4055.231 |                                         1
 
SQL statistics:
    queries performed:
        read:                            0
        write:                           163345
        other:                           0
        total:                           163345
    transactions:                        163345 (1569.71 per sec.)
    queries:                             163345 (1569.71 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          104.0592s
    total number of events:              163345

Latency (ms):
         min:                                    9.75
         avg:                                   19.64
         max:                                 4059.10
         99th percentile:                       34.33
         sum:                              3207334.45

Threads fairness:
    events (avg/stddev):           5104.5312/69.18
    execution time (avg/stddev):   100.2292/0.96